; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 877154 2 3 2 6 5
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	image1 - mode
	infrared0 - mode
	Star0 - direction
	Star4 - direction
	GroundStation1 - direction
	GroundStation2 - direction
	Star5 - direction
	Star3 - direction
	Planet6 - direction
	Star7 - direction
	Phenomenon8 - direction
	Phenomenon9 - direction
	Star10 - direction
)
(:init
	(supports instrument0 image1)
	(calibration_target instrument0 GroundStation1)
	(calibration_target instrument0 Star5)
	(supports instrument1 image1)
	(supports instrument1 infrared0)
	(calibration_target instrument1 Star3)
	(supports instrument2 image1)
	(calibration_target instrument2 GroundStation2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation1)
	(supports instrument3 infrared0)
	(supports instrument3 image1)
	(calibration_target instrument3 GroundStation2)
	(supports instrument4 image1)
	(calibration_target instrument4 Star5)
	(supports instrument5 infrared0)
	(supports instrument5 image1)
	(calibration_target instrument5 Star3)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation1)
)
(:goal (and
	(pointing satellite0 Star3)
	(have_image Planet6 infrared0)
	(have_image Star7 image1)
	(have_image Phenomenon8 image1)
	(have_image Phenomenon9 infrared0)
	(have_image Star10 infrared0)
))

)

; plan
1. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 6
2. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 6
3. (turn_to satellite0 star3 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 star3)
   goals met: 1 of 6
4. (turn_to satellite1 groundstation2 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 groundstation2)
   goals met: 1 of 6
5. (calibrate satellite0 instrument1 star3)
   added: (calibrated instrument1)
   goals met: 1 of 6
6. (calibrate satellite1 instrument3 groundstation2)
   added: (calibrated instrument3)
   goals met: 1 of 6
7. (turn_to satellite0 star7 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 star7)
   goals met: 0 of 6
8. (turn_to satellite1 star10 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 star10)
   goals met: 0 of 6
9. (take_image satellite1 star10 instrument3 infrared0)
   added: (have_image star10 infrared0)
   goals met: 1 of 6
10. (take_image satellite0 star7 instrument1 image1)
   added: (have_image star7 image1)
   goals met: 2 of 6
11. (turn_to satellite0 star3 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star3)
   goals met: 3 of 6
12. (turn_to satellite1 planet6 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 planet6)
   goals met: 3 of 6
13. (take_image satellite1 planet6 instrument3 infrared0)
   added: (have_image planet6 infrared0)
   goals met: 4 of 6
14. (turn_to satellite0 phenomenon8 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 phenomenon8)
   goals met: 3 of 6
15. (turn_to satellite1 phenomenon9 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 phenomenon9)
   goals met: 3 of 6
16. (take_image satellite0 phenomenon8 instrument1 image1)
   added: (have_image phenomenon8 image1)
   goals met: 4 of 6
17. (turn_to satellite0 star3 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 star3)
   goals met: 5 of 6
18. (take_image satellite1 phenomenon9 instrument3 infrared0)
   added: (have_image phenomenon9 infrared0)
   goals met: 6 of 6
